node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1000
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 1000
          }
        }
        string_val: "../data/cifar10/23681_8.jpg"
        string_val: "../data/cifar10/49252_4.jpg"
        string_val: "../data/cifar10/38347_1.jpg"
        string_val: "../data/cifar10/9707_5.jpg"
        string_val: "../data/cifar10/46937_8.jpg"
        string_val: "../data/cifar10/15146_2.jpg"
        string_val: "../data/cifar10/29531_2.jpg"
        string_val: "../data/cifar10/9822_1.jpg"
        string_val: "../data/cifar10/337_5.jpg"
        string_val: "../data/cifar10/27974_5.jpg"
        string_val: "../data/cifar10/13416_4.jpg"
        string_val: "../data/cifar10/38090_4.jpg"
        string_val: "../data/cifar10/28647_4.jpg"
        string_val: "../data/cifar10/17473_7.jpg"
        string_val: "../data/cifar10/7598_7.jpg"
        string_val: "../data/cifar10/210_6.jpg"
        string_val: "../data/cifar10/1168_0.jpg"
        string_val: "../data/cifar10/23093_5.jpg"
        string_val: "../data/cifar10/31747_1.jpg"
        string_val: "../data/cifar10/35478_3.jpg"
        string_val: "../data/cifar10/37674_0.jpg"
        string_val: "../data/cifar10/33614_4.jpg"
        string_val: "../data/cifar10/6057_9.jpg"
        string_val: "../data/cifar10/27860_4.jpg"
        string_val: "../data/cifar10/2171_0.jpg"
        string_val: "../data/cifar10/11850_1.jpg"
        string_val: "../data/cifar10/20923_4.jpg"
        string_val: "../data/cifar10/35991_0.jpg"
        string_val: "../data/cifar10/23313_1.jpg"
        string_val: "../data/cifar10/8283_8.jpg"
        string_val: "../data/cifar10/44289_9.jpg"
        string_val: "../data/cifar10/16650_8.jpg"
        string_val: "../data/cifar10/11599_9.jpg"
        string_val: "../data/cifar10/28203_6.jpg"
        string_val: "../data/cifar10/14011_8.jpg"
        string_val: "../data/cifar10/43719_9.jpg"
        string_val: "../data/cifar10/13685_5.jpg"
        string_val: "../data/cifar10/28845_5.jpg"
        string_val: "../data/cifar10/11162_7.jpg"
        string_val: "../data/cifar10/49855_3.jpg"
        string_val: "../data/cifar10/44924_0.jpg"
        string_val: "../data/cifar10/16031_7.jpg"
        string_val: "../data/cifar10/37008_2.jpg"
        string_val: "../data/cifar10/26117_9.jpg"
        string_val: "../data/cifar10/12459_6.jpg"
        string_val: "../data/cifar10/992_3.jpg"
        string_val: "../data/cifar10/36958_5.jpg"
        string_val: "../data/cifar10/11093_6.jpg"
        string_val: "../data/cifar10/22394_1.jpg"
        string_val: "../data/cifar10/5608_7.jpg"
        string_val: "../data/cifar10/31163_4.jpg"
        string_val: "../data/cifar10/13684_8.jpg"
        string_val: "../data/cifar10/25455_2.jpg"
        string_val: "../data/cifar10/34618_1.jpg"
        string_val: "../data/cifar10/34854_5.jpg"
        string_val: "../data/cifar10/48571_5.jpg"
        string_val: "../data/cifar10/46529_3.jpg"
        string_val: "../data/cifar10/48185_1.jpg"
        string_val: "../data/cifar10/43253_0.jpg"
        string_val: "../data/cifar10/41133_1.jpg"
        string_val: "../data/cifar10/38608_8.jpg"
        string_val: "../data/cifar10/39029_5.jpg"
        string_val: "../data/cifar10/14581_8.jpg"
        string_val: "../data/cifar10/5411_5.jpg"
        string_val: "../data/cifar10/30264_7.jpg"
        string_val: "../data/cifar10/16210_5.jpg"
        string_val: "../data/cifar10/18790_2.jpg"
        string_val: "../data/cifar10/1100_3.jpg"
        string_val: "../data/cifar10/47825_8.jpg"
        string_val: "../data/cifar10/32418_1.jpg"
        string_val: "../data/cifar10/32001_5.jpg"
        string_val: "../data/cifar10/18636_7.jpg"
        string_val: "../data/cifar10/13079_8.jpg"
        string_val: "../data/cifar10/12867_8.jpg"
        string_val: "../data/cifar10/15387_6.jpg"
        string_val: "../data/cifar10/11792_6.jpg"
        string_val: "../data/cifar10/19071_5.jpg"
        string_val: "../data/cifar10/20461_8.jpg"
        string_val: "../data/cifar10/11803_9.jpg"
        string_val: "../data/cifar10/15738_1.jpg"
        string_val: "../data/cifar10/34127_4.jpg"
        string_val: "../data/cifar10/6499_2.jpg"
        string_val: "../data/cifar10/45744_2.jpg"
        string_val: "../data/cifar10/35466_2.jpg"
        string_val: "../data/cifar10/8710_3.jpg"
        string_val: "../data/cifar10/12870_3.jpg"
        string_val: "../data/cifar10/29297_2.jpg"
        string_val: "../data/cifar10/34156_6.jpg"
        string_val: "../data/cifar10/3_4.jpg"
        string_val: "../data/cifar10/17372_6.jpg"
        string_val: "../data/cifar10/29109_3.jpg"
        string_val: "../data/cifar10/34937_7.jpg"
        string_val: "../data/cifar10/7708_9.jpg"
        string_val: "../data/cifar10/32149_0.jpg"
        string_val: "../data/cifar10/25550_5.jpg"
        string_val: "../data/cifar10/22041_1.jpg"
        string_val: "../data/cifar10/9476_1.jpg"
        string_val: "../data/cifar10/17632_4.jpg"
        string_val: "../data/cifar10/26878_1.jpg"
        string_val: "../data/cifar10/23665_5.jpg"
        string_val: "../data/cifar10/35662_0.jpg"
        string_val: "../data/cifar10/44652_2.jpg"
        string_val: "../data/cifar10/28589_7.jpg"
        string_val: "../data/cifar10/49764_8.jpg"
        string_val: "../data/cifar10/34044_7.jpg"
        string_val: "../data/cifar10/1043_9.jpg"
        string_val: "../data/cifar10/45287_9.jpg"
        string_val: "../data/cifar10/31362_8.jpg"
        string_val: "../data/cifar10/45689_4.jpg"
        string_val: "../data/cifar10/11614_1.jpg"
        string_val: "../data/cifar10/40341_1.jpg"
        string_val: "../data/cifar10/9142_6.jpg"
        string_val: "../data/cifar10/14797_5.jpg"
        string_val: "../data/cifar10/11995_5.jpg"
        string_val: "../data/cifar10/16277_5.jpg"
        string_val: "../data/cifar10/16283_6.jpg"
        string_val: "../data/cifar10/7451_8.jpg"
        string_val: "../data/cifar10/11234_3.jpg"
        string_val: "../data/cifar10/29249_2.jpg"
        string_val: "../data/cifar10/36682_2.jpg"
        string_val: "../data/cifar10/35966_1.jpg"
        string_val: "../data/cifar10/34250_0.jpg"
        string_val: "../data/cifar10/17965_0.jpg"
        string_val: "../data/cifar10/8833_0.jpg"
        string_val: "../data/cifar10/24865_2.jpg"
        string_val: "../data/cifar10/21319_8.jpg"
        string_val: "../data/cifar10/19044_2.jpg"
        string_val: "../data/cifar10/13085_3.jpg"
        string_val: "../data/cifar10/39919_3.jpg"
        string_val: "../data/cifar10/555_0.jpg"
        string_val: "../data/cifar10/45484_0.jpg"
        string_val: "../data/cifar10/43059_2.jpg"
        string_val: "../data/cifar10/31985_1.jpg"
        string_val: "../data/cifar10/24872_6.jpg"
        string_val: "../data/cifar10/45676_6.jpg"
        string_val: "../data/cifar10/9402_1.jpg"
        string_val: "../data/cifar10/43757_0.jpg"
        string_val: "../data/cifar10/6953_7.jpg"
        string_val: "../data/cifar10/29764_8.jpg"
        string_val: "../data/cifar10/19777_7.jpg"
        string_val: "../data/cifar10/41596_7.jpg"
        string_val: "../data/cifar10/37475_3.jpg"
        string_val: "../data/cifar10/35745_6.jpg"
        string_val: "../data/cifar10/5637_9.jpg"
        string_val: "../data/cifar10/9232_1.jpg"
        string_val: "../data/cifar10/36083_4.jpg"
        string_val: "../data/cifar10/37293_7.jpg"
        string_val: "../data/cifar10/37033_6.jpg"
        string_val: "../data/cifar10/27513_4.jpg"
        string_val: "../data/cifar10/3360_4.jpg"
        string_val: "../data/cifar10/153_4.jpg"
        string_val: "../data/cifar10/30129_5.jpg"
        string_val: "../data/cifar10/7081_0.jpg"
        string_val: "../data/cifar10/43366_5.jpg"
        string_val: "../data/cifar10/22459_2.jpg"
        string_val: "../data/cifar10/40602_1.jpg"
        string_val: "../data/cifar10/1768_2.jpg"
        string_val: "../data/cifar10/45070_1.jpg"
        string_val: "../data/cifar10/21555_9.jpg"
        string_val: "../data/cifar10/30178_9.jpg"
        string_val: "../data/cifar10/14576_4.jpg"
        string_val: "../data/cifar10/13287_3.jpg"
        string_val: "../data/cifar10/37958_5.jpg"
        string_val: "../data/cifar10/43230_7.jpg"
        string_val: "../data/cifar10/30469_6.jpg"
        string_val: "../data/cifar10/32877_5.jpg"
        string_val: "../data/cifar10/44831_2.jpg"
        string_val: "../data/cifar10/24496_2.jpg"
        string_val: "../data/cifar10/27580_2.jpg"
        string_val: "../data/cifar10/11389_3.jpg"
        string_val: "../data/cifar10/42309_0.jpg"
        string_val: "../data/cifar10/49707_5.jpg"
        string_val: "../data/cifar10/39886_0.jpg"
        string_val: "../data/cifar10/43295_3.jpg"
        string_val: "../data/cifar10/3211_0.jpg"
        string_val: "../data/cifar10/35343_0.jpg"
        string_val: "../data/cifar10/19282_0.jpg"
        string_val: "../data/cifar10/36576_6.jpg"
        string_val: "../data/cifar10/27576_1.jpg"
        string_val: "../data/cifar10/46028_8.jpg"
        string_val: "../data/cifar10/22155_2.jpg"
        string_val: "../data/cifar10/2008_7.jpg"
        string_val: "../data/cifar10/40953_1.jpg"
        string_val: "../data/cifar10/34584_7.jpg"
        string_val: "../data/cifar10/47570_4.jpg"
        string_val: "../data/cifar10/33109_8.jpg"
        string_val: "../data/cifar10/30132_4.jpg"
        string_val: "../data/cifar10/4949_1.jpg"
        string_val: "../data/cifar10/22592_7.jpg"
        string_val: "../data/cifar10/43288_0.jpg"
        string_val: "../data/cifar10/38910_4.jpg"
        string_val: "../data/cifar10/17825_5.jpg"
        string_val: "../data/cifar10/28525_0.jpg"
        string_val: "../data/cifar10/26418_5.jpg"
        string_val: "../data/cifar10/20467_8.jpg"
        string_val: "../data/cifar10/1143_4.jpg"
        string_val: "../data/cifar10/2461_4.jpg"
        string_val: "../data/cifar10/44930_0.jpg"
        string_val: "../data/cifar10/49275_2.jpg"
        string_val: "../data/cifar10/47251_8.jpg"
        string_val: "../data/cifar10/8093_1.jpg"
        string_val: "../data/cifar10/43498_7.jpg"
        string_val: "../data/cifar10/19904_0.jpg"
        string_val: "../data/cifar10/6279_5.jpg"
        string_val: "../data/cifar10/11184_9.jpg"
        string_val: "../data/cifar10/34908_9.jpg"
        string_val: "../data/cifar10/10198_9.jpg"
        string_val: "../data/cifar10/2796_6.jpg"
        string_val: "../data/cifar10/54_2.jpg"
        string_val: "../data/cifar10/25897_9.jpg"
        string_val: "../data/cifar10/24625_1.jpg"
        string_val: "../data/cifar10/24130_5.jpg"
        string_val: "../data/cifar10/35411_0.jpg"
        string_val: "../data/cifar10/28784_1.jpg"
        string_val: "../data/cifar10/10459_7.jpg"
        string_val: "../data/cifar10/44196_5.jpg"
        string_val: "../data/cifar10/47031_9.jpg"
        string_val: "../data/cifar10/16893_4.jpg"
        string_val: "../data/cifar10/29844_0.jpg"
        string_val: "../data/cifar10/26446_9.jpg"
        string_val: "../data/cifar10/42871_4.jpg"
        string_val: "../data/cifar10/14043_6.jpg"
        string_val: "../data/cifar10/2793_9.jpg"
        string_val: "../data/cifar10/18397_8.jpg"
        string_val: "../data/cifar10/32015_5.jpg"
        string_val: "../data/cifar10/9068_8.jpg"
        string_val: "../data/cifar10/1908_7.jpg"
        string_val: "../data/cifar10/12742_2.jpg"
        string_val: "../data/cifar10/45164_6.jpg"
        string_val: "../data/cifar10/619_6.jpg"
        string_val: "../data/cifar10/4805_6.jpg"
        string_val: "../data/cifar10/25780_8.jpg"
        string_val: "../data/cifar10/22774_8.jpg"
        string_val: "../data/cifar10/42010_0.jpg"
        string_val: "../data/cifar10/1651_1.jpg"
        string_val: "../data/cifar10/22129_0.jpg"
        string_val: "../data/cifar10/45582_6.jpg"
        string_val: "../data/cifar10/19455_3.jpg"
        string_val: "../data/cifar10/3532_6.jpg"
        string_val: "../data/cifar10/47388_5.jpg"
        string_val: "../data/cifar10/26002_9.jpg"
        string_val: "../data/cifar10/4575_8.jpg"
        string_val: "../data/cifar10/5967_2.jpg"
        string_val: "../data/cifar10/7116_2.jpg"
        string_val: "../data/cifar10/9435_0.jpg"
        string_val: "../data/cifar10/5998_4.jpg"
        string_val: "../data/cifar10/11030_2.jpg"
        string_val: "../data/cifar10/26149_8.jpg"
        string_val: "../data/cifar10/39568_6.jpg"
        string_val: "../data/cifar10/19131_8.jpg"
        string_val: "../data/cifar10/20208_3.jpg"
        string_val: "../data/cifar10/33080_4.jpg"
        string_val: "../data/cifar10/23996_3.jpg"
        string_val: "../data/cifar10/41387_6.jpg"
        string_val: "../data/cifar10/5169_6.jpg"
        string_val: "../data/cifar10/42467_8.jpg"
        string_val: "../data/cifar10/2187_9.jpg"
        string_val: "../data/cifar10/8262_3.jpg"
        string_val: "../data/cifar10/30479_3.jpg"
        string_val: "../data/cifar10/12837_3.jpg"
        string_val: "../data/cifar10/30701_5.jpg"
        string_val: "../data/cifar10/8266_3.jpg"
        string_val: "../data/cifar10/48381_5.jpg"
        string_val: "../data/cifar10/2368_8.jpg"
        string_val: "../data/cifar10/3894_5.jpg"
        string_val: "../data/cifar10/23008_6.jpg"
        string_val: "../data/cifar10/28635_9.jpg"
        string_val: "../data/cifar10/49161_8.jpg"
        string_val: "../data/cifar10/49938_5.jpg"
        string_val: "../data/cifar10/27309_2.jpg"
        string_val: "../data/cifar10/48481_8.jpg"
        string_val: "../data/cifar10/2622_0.jpg"
        string_val: "../data/cifar10/35134_1.jpg"
        string_val: "../data/cifar10/21321_2.jpg"
        string_val: "../data/cifar10/25107_7.jpg"
        string_val: "../data/cifar10/44115_7.jpg"
        string_val: "../data/cifar10/44546_0.jpg"
        string_val: "../data/cifar10/40714_2.jpg"
        string_val: "../data/cifar10/6338_5.jpg"
        string_val: "../data/cifar10/47329_0.jpg"
        string_val: "../data/cifar10/6988_1.jpg"
        string_val: "../data/cifar10/589_7.jpg"
        string_val: "../data/cifar10/31352_1.jpg"
        string_val: "../data/cifar10/9096_0.jpg"
        string_val: "../data/cifar10/31123_7.jpg"
        string_val: "../data/cifar10/49349_0.jpg"
        string_val: "../data/cifar10/24464_4.jpg"
        string_val: "../data/cifar10/27972_9.jpg"
        string_val: "../data/cifar10/21481_6.jpg"
        string_val: "../data/cifar10/43500_3.jpg"
        string_val: "../data/cifar10/48803_7.jpg"
        string_val: "../data/cifar10/33741_2.jpg"
        string_val: "../data/cifar10/6225_8.jpg"
        string_val: "../data/cifar10/7424_4.jpg"
        string_val: "../data/cifar10/27508_6.jpg"
        string_val: "../data/cifar10/20166_7.jpg"
        string_val: "../data/cifar10/1550_6.jpg"
        string_val: "../data/cifar10/31799_4.jpg"
        string_val: "../data/cifar10/27494_4.jpg"
        string_val: "../data/cifar10/27955_8.jpg"
        string_val: "../data/cifar10/32740_7.jpg"
        string_val: "../data/cifar10/6553_0.jpg"
        string_val: "../data/cifar10/8873_6.jpg"
        string_val: "../data/cifar10/18584_3.jpg"
        string_val: "../data/cifar10/39484_1.jpg"
        string_val: "../data/cifar10/31883_5.jpg"
        string_val: "../data/cifar10/3404_1.jpg"
        string_val: "../data/cifar10/10087_8.jpg"
        string_val: "../data/cifar10/44092_8.jpg"
        string_val: "../data/cifar10/14931_5.jpg"
        string_val: "../data/cifar10/39225_5.jpg"
        string_val: "../data/cifar10/24432_2.jpg"
        string_val: "../data/cifar10/24656_5.jpg"
        string_val: "../data/cifar10/44312_5.jpg"
        string_val: "../data/cifar10/10229_1.jpg"
        string_val: "../data/cifar10/38255_8.jpg"
        string_val: "../data/cifar10/37522_0.jpg"
        string_val: "../data/cifar10/11657_6.jpg"
        string_val: "../data/cifar10/44888_8.jpg"
        string_val: "../data/cifar10/30108_2.jpg"
        string_val: "../data/cifar10/19664_0.jpg"
        string_val: "../data/cifar10/5217_8.jpg"
        string_val: "../data/cifar10/30319_7.jpg"
        string_val: "../data/cifar10/30971_0.jpg"
        string_val: "../data/cifar10/16063_1.jpg"
        string_val: "../data/cifar10/1260_0.jpg"
        string_val: "../data/cifar10/34708_7.jpg"
        string_val: "../data/cifar10/34822_3.jpg"
        string_val: "../data/cifar10/49002_4.jpg"
        string_val: "../data/cifar10/5388_9.jpg"
        string_val: "../data/cifar10/3349_2.jpg"
        string_val: "../data/cifar10/31470_4.jpg"
        string_val: "../data/cifar10/5635_1.jpg"
        string_val: "../data/cifar10/12329_3.jpg"
        string_val: "../data/cifar10/34526_9.jpg"
        string_val: "../data/cifar10/29019_1.jpg"
        string_val: "../data/cifar10/2274_6.jpg"
        string_val: "../data/cifar10/45487_1.jpg"
        string_val: "../data/cifar10/14003_6.jpg"
        string_val: "../data/cifar10/17184_3.jpg"
        string_val: "../data/cifar10/31957_1.jpg"
        string_val: "../data/cifar10/20391_1.jpg"
        string_val: "../data/cifar10/28879_9.jpg"
        string_val: "../data/cifar10/42952_0.jpg"
        string_val: "../data/cifar10/7290_3.jpg"
        string_val: "../data/cifar10/4656_2.jpg"
        string_val: "../data/cifar10/30107_5.jpg"
        string_val: "../data/cifar10/7533_3.jpg"
        string_val: "../data/cifar10/2162_3.jpg"
        string_val: "../data/cifar10/37502_2.jpg"
        string_val: "../data/cifar10/48801_4.jpg"
        string_val: "../data/cifar10/4588_2.jpg"
        string_val: "../data/cifar10/24518_3.jpg"
        string_val: "../data/cifar10/11448_7.jpg"
        string_val: "../data/cifar10/46665_2.jpg"
        string_val: "../data/cifar10/22470_5.jpg"
        string_val: "../data/cifar10/23963_3.jpg"
        string_val: "../data/cifar10/32444_0.jpg"
        string_val: "../data/cifar10/8422_3.jpg"
        string_val: "../data/cifar10/1466_0.jpg"
        string_val: "../data/cifar10/47007_9.jpg"
        string_val: "../data/cifar10/29002_9.jpg"
        string_val: "../data/cifar10/19569_4.jpg"
        string_val: "../data/cifar10/27788_9.jpg"
        string_val: "../data/cifar10/10218_6.jpg"
        string_val: "../data/cifar10/14341_0.jpg"
        string_val: "../data/cifar10/15861_5.jpg"
        string_val: "../data/cifar10/36197_2.jpg"
        string_val: "../data/cifar10/19159_7.jpg"
        string_val: "../data/cifar10/18528_7.jpg"
        string_val: "../data/cifar10/6861_9.jpg"
        string_val: "../data/cifar10/12335_1.jpg"
        string_val: "../data/cifar10/23084_6.jpg"
        string_val: "../data/cifar10/15394_1.jpg"
        string_val: "../data/cifar10/3160_8.jpg"
        string_val: "../data/cifar10/17222_0.jpg"
        string_val: "../data/cifar10/977_1.jpg"
        string_val: "../data/cifar10/38369_5.jpg"
        string_val: "../data/cifar10/7862_1.jpg"
        string_val: "../data/cifar10/31089_9.jpg"
        string_val: "../data/cifar10/22110_3.jpg"
        string_val: "../data/cifar10/40308_7.jpg"
        string_val: "../data/cifar10/34341_0.jpg"
        string_val: "../data/cifar10/9961_9.jpg"
        string_val: "../data/cifar10/22086_5.jpg"
        string_val: "../data/cifar10/22132_8.jpg"
        string_val: "../data/cifar10/25229_6.jpg"
        string_val: "../data/cifar10/9137_2.jpg"
        string_val: "../data/cifar10/7434_0.jpg"
        string_val: "../data/cifar10/19886_1.jpg"
        string_val: "../data/cifar10/32379_3.jpg"
        string_val: "../data/cifar10/22666_5.jpg"
        string_val: "../data/cifar10/46654_9.jpg"
        string_val: "../data/cifar10/29367_0.jpg"
        string_val: "../data/cifar10/2418_4.jpg"
        string_val: "../data/cifar10/9855_6.jpg"
        string_val: "../data/cifar10/24099_3.jpg"
        string_val: "../data/cifar10/25869_8.jpg"
        string_val: "../data/cifar10/18781_7.jpg"
        string_val: "../data/cifar10/18439_9.jpg"
        string_val: "../data/cifar10/48915_1.jpg"
        string_val: "../data/cifar10/28389_5.jpg"
        string_val: "../data/cifar10/48566_5.jpg"
        string_val: "../data/cifar10/31445_1.jpg"
        string_val: "../data/cifar10/45176_0.jpg"
        string_val: "../data/cifar10/40571_8.jpg"
        string_val: "../data/cifar10/16808_3.jpg"
        string_val: "../data/cifar10/41652_6.jpg"
        string_val: "../data/cifar10/24442_5.jpg"
        string_val: "../data/cifar10/22372_1.jpg"
        string_val: "../data/cifar10/27993_3.jpg"
        string_val: "../data/cifar10/39559_6.jpg"
        string_val: "../data/cifar10/43301_0.jpg"
        string_val: "../data/cifar10/45136_4.jpg"
        string_val: "../data/cifar10/2936_2.jpg"
        string_val: "../data/cifar10/13571_1.jpg"
        string_val: "../data/cifar10/19485_1.jpg"
        string_val: "../data/cifar10/30981_7.jpg"
        string_val: "../data/cifar10/11019_7.jpg"
        string_val: "../data/cifar10/34181_2.jpg"
        string_val: "../data/cifar10/36558_0.jpg"
        string_val: "../data/cifar10/27090_3.jpg"
        string_val: "../data/cifar10/45905_9.jpg"
        string_val: "../data/cifar10/31020_2.jpg"
        string_val: "../data/cifar10/25181_1.jpg"
        string_val: "../data/cifar10/17061_9.jpg"
        string_val: "../data/cifar10/28629_5.jpg"
        string_val: "../data/cifar10/28915_9.jpg"
        string_val: "../data/cifar10/3758_3.jpg"
        string_val: "../data/cifar10/12323_2.jpg"
        string_val: "../data/cifar10/6061_3.jpg"
        string_val: "../data/cifar10/43607_2.jpg"
        string_val: "../data/cifar10/15520_8.jpg"
        string_val: "../data/cifar10/40499_4.jpg"
        string_val: "../data/cifar10/30268_4.jpg"
        string_val: "../data/cifar10/31943_6.jpg"
        string_val: "../data/cifar10/37262_7.jpg"
        string_val: "../data/cifar10/29960_3.jpg"
        string_val: "../data/cifar10/5404_0.jpg"
        string_val: "../data/cifar10/6630_1.jpg"
        string_val: "../data/cifar10/12700_9.jpg"
        string_val: "../data/cifar10/41996_9.jpg"
        string_val: "../data/cifar10/9793_5.jpg"
        string_val: "../data/cifar10/1959_6.jpg"
        string_val: "../data/cifar10/16928_3.jpg"
        string_val: "../data/cifar10/13879_2.jpg"
        string_val: "../data/cifar10/5143_4.jpg"
        string_val: "../data/cifar10/15966_1.jpg"
        string_val: "../data/cifar10/48955_4.jpg"
        string_val: "../data/cifar10/37031_9.jpg"
        string_val: "../data/cifar10/15222_7.jpg"
        string_val: "../data/cifar10/40963_8.jpg"
        string_val: "../data/cifar10/10653_3.jpg"
        string_val: "../data/cifar10/45062_8.jpg"
        string_val: "../data/cifar10/45965_4.jpg"
        string_val: "../data/cifar10/45316_1.jpg"
        string_val: "../data/cifar10/42219_4.jpg"
        string_val: "../data/cifar10/43012_0.jpg"
        string_val: "../data/cifar10/47829_8.jpg"
        string_val: "../data/cifar10/30189_5.jpg"
        string_val: "../data/cifar10/16802_4.jpg"
        string_val: "../data/cifar10/25307_3.jpg"
        string_val: "../data/cifar10/3146_7.jpg"
        string_val: "../data/cifar10/40627_6.jpg"
        string_val: "../data/cifar10/17249_2.jpg"
        string_val: "../data/cifar10/30260_5.jpg"
        string_val: "../data/cifar10/44163_6.jpg"
        string_val: "../data/cifar10/29273_3.jpg"
        string_val: "../data/cifar10/25725_8.jpg"
        string_val: "../data/cifar10/8714_3.jpg"
        string_val: "../data/cifar10/38163_7.jpg"
        string_val: "../data/cifar10/3598_7.jpg"
        string_val: "../data/cifar10/36579_8.jpg"
        string_val: "../data/cifar10/40010_7.jpg"
        string_val: "../data/cifar10/42282_1.jpg"
        string_val: "../data/cifar10/5687_8.jpg"
        string_val: "../data/cifar10/32876_8.jpg"
        string_val: "../data/cifar10/37747_0.jpg"
        string_val: "../data/cifar10/45408_4.jpg"
        string_val: "../data/cifar10/9420_2.jpg"
        string_val: "../data/cifar10/35298_3.jpg"
        string_val: "../data/cifar10/1501_2.jpg"
        string_val: "../data/cifar10/24860_8.jpg"
        string_val: "../data/cifar10/32466_9.jpg"
        string_val: "../data/cifar10/44952_9.jpg"
        string_val: "../data/cifar10/19393_7.jpg"
        string_val: "../data/cifar10/45349_0.jpg"
        string_val: "../data/cifar10/34177_9.jpg"
        string_val: "../data/cifar10/9889_1.jpg"
        string_val: "../data/cifar10/33204_2.jpg"
        string_val: "../data/cifar10/48422_5.jpg"
        string_val: "../data/cifar10/47670_1.jpg"
        string_val: "../data/cifar10/23718_7.jpg"
        string_val: "../data/cifar10/47254_1.jpg"
        string_val: "../data/cifar10/37643_8.jpg"
        string_val: "../data/cifar10/11165_5.jpg"
        string_val: "../data/cifar10/39048_9.jpg"
        string_val: "../data/cifar10/3073_0.jpg"
        string_val: "../data/cifar10/10806_9.jpg"
        string_val: "../data/cifar10/47976_6.jpg"
        string_val: "../data/cifar10/13069_0.jpg"
        string_val: "../data/cifar10/38466_0.jpg"
        string_val: "../data/cifar10/2691_4.jpg"
        string_val: "../data/cifar10/3139_6.jpg"
        string_val: "../data/cifar10/11362_2.jpg"
        string_val: "../data/cifar10/25599_0.jpg"
        string_val: "../data/cifar10/42988_2.jpg"
        string_val: "../data/cifar10/30738_1.jpg"
        string_val: "../data/cifar10/42726_1.jpg"
        string_val: "../data/cifar10/28603_4.jpg"
        string_val: "../data/cifar10/30974_2.jpg"
        string_val: "../data/cifar10/27594_2.jpg"
        string_val: "../data/cifar10/7637_7.jpg"
        string_val: "../data/cifar10/16767_5.jpg"
        string_val: "../data/cifar10/8839_3.jpg"
        string_val: "../data/cifar10/38529_5.jpg"
        string_val: "../data/cifar10/30495_1.jpg"
        string_val: "../data/cifar10/44222_7.jpg"
        string_val: "../data/cifar10/46136_3.jpg"
        string_val: "../data/cifar10/26537_6.jpg"
        string_val: "../data/cifar10/34585_4.jpg"
        string_val: "../data/cifar10/38391_6.jpg"
        string_val: "../data/cifar10/33271_1.jpg"
        string_val: "../data/cifar10/45384_0.jpg"
        string_val: "../data/cifar10/43486_4.jpg"
        string_val: "../data/cifar10/49676_1.jpg"
        string_val: "../data/cifar10/21903_0.jpg"
        string_val: "../data/cifar10/36342_7.jpg"
        string_val: "../data/cifar10/8553_0.jpg"
        string_val: "../data/cifar10/30017_5.jpg"
        string_val: "../data/cifar10/273_9.jpg"
        string_val: "../data/cifar10/5210_0.jpg"
        string_val: "../data/cifar10/43563_4.jpg"
        string_val: "../data/cifar10/42453_7.jpg"
        string_val: "../data/cifar10/8072_0.jpg"
        string_val: "../data/cifar10/5993_5.jpg"
        string_val: "../data/cifar10/38986_9.jpg"
        string_val: "../data/cifar10/35554_0.jpg"
        string_val: "../data/cifar10/1532_2.jpg"
        string_val: "../data/cifar10/18208_6.jpg"
        string_val: "../data/cifar10/28144_5.jpg"
        string_val: "../data/cifar10/43469_2.jpg"
        string_val: "../data/cifar10/18661_2.jpg"
        string_val: "../data/cifar10/3695_4.jpg"
        string_val: "../data/cifar10/29509_5.jpg"
        string_val: "../data/cifar10/49186_1.jpg"
        string_val: "../data/cifar10/48167_6.jpg"
        string_val: "../data/cifar10/26594_8.jpg"
        string_val: "../data/cifar10/31975_3.jpg"
        string_val: "../data/cifar10/11073_0.jpg"
        string_val: "../data/cifar10/46253_4.jpg"
        string_val: "../data/cifar10/28067_3.jpg"
        string_val: "../data/cifar10/48745_2.jpg"
        string_val: "../data/cifar10/33321_1.jpg"
        string_val: "../data/cifar10/18934_5.jpg"
        string_val: "../data/cifar10/22600_8.jpg"
        string_val: "../data/cifar10/37520_7.jpg"
        string_val: "../data/cifar10/15884_0.jpg"
        string_val: "../data/cifar10/43313_3.jpg"
        string_val: "../data/cifar10/7901_5.jpg"
        string_val: "../data/cifar10/39892_1.jpg"
        string_val: "../data/cifar10/10580_7.jpg"
        string_val: "../data/cifar10/29892_7.jpg"
        string_val: "../data/cifar10/16960_6.jpg"
        string_val: "../data/cifar10/22969_4.jpg"
        string_val: "../data/cifar10/4539_8.jpg"
        string_val: "../data/cifar10/24991_3.jpg"
        string_val: "../data/cifar10/36630_4.jpg"
        string_val: "../data/cifar10/34109_0.jpg"
        string_val: "../data/cifar10/12072_0.jpg"
        string_val: "../data/cifar10/25074_3.jpg"
        string_val: "../data/cifar10/3644_0.jpg"
        string_val: "../data/cifar10/3883_8.jpg"
        string_val: "../data/cifar10/42716_4.jpg"
        string_val: "../data/cifar10/42345_2.jpg"
        string_val: "../data/cifar10/34358_1.jpg"
        string_val: "../data/cifar10/7641_7.jpg"
        string_val: "../data/cifar10/39972_3.jpg"
        string_val: "../data/cifar10/18215_0.jpg"
        string_val: "../data/cifar10/13905_4.jpg"
        string_val: "../data/cifar10/3168_6.jpg"
        string_val: "../data/cifar10/37701_6.jpg"
        string_val: "../data/cifar10/10613_8.jpg"
        string_val: "../data/cifar10/17524_7.jpg"
        string_val: "../data/cifar10/34701_1.jpg"
        string_val: "../data/cifar10/23572_8.jpg"
        string_val: "../data/cifar10/13072_8.jpg"
        string_val: "../data/cifar10/42090_2.jpg"
        string_val: "../data/cifar10/43122_2.jpg"
        string_val: "../data/cifar10/27750_2.jpg"
        string_val: "../data/cifar10/15709_5.jpg"
        string_val: "../data/cifar10/377_3.jpg"
        string_val: "../data/cifar10/24581_0.jpg"
        string_val: "../data/cifar10/44571_1.jpg"
        string_val: "../data/cifar10/29726_8.jpg"
        string_val: "../data/cifar10/14144_7.jpg"
        string_val: "../data/cifar10/26369_8.jpg"
        string_val: "../data/cifar10/13804_6.jpg"
        string_val: "../data/cifar10/3058_8.jpg"
        string_val: "../data/cifar10/47313_3.jpg"
        string_val: "../data/cifar10/21661_1.jpg"
        string_val: "../data/cifar10/10777_0.jpg"
        string_val: "../data/cifar10/42985_4.jpg"
        string_val: "../data/cifar10/38652_3.jpg"
        string_val: "../data/cifar10/16495_3.jpg"
        string_val: "../data/cifar10/13911_5.jpg"
        string_val: "../data/cifar10/6014_3.jpg"
        string_val: "../data/cifar10/5142_6.jpg"
        string_val: "../data/cifar10/47169_7.jpg"
        string_val: "../data/cifar10/48031_9.jpg"
        string_val: "../data/cifar10/8464_5.jpg"
        string_val: "../data/cifar10/39509_4.jpg"
        string_val: "../data/cifar10/46289_5.jpg"
        string_val: "../data/cifar10/8988_3.jpg"
        string_val: "../data/cifar10/32722_4.jpg"
        string_val: "../data/cifar10/25134_6.jpg"
        string_val: "../data/cifar10/29148_9.jpg"
        string_val: "../data/cifar10/36445_1.jpg"
        string_val: "../data/cifar10/47713_8.jpg"
        string_val: "../data/cifar10/34968_2.jpg"
        string_val: "../data/cifar10/19238_8.jpg"
        string_val: "../data/cifar10/10963_1.jpg"
        string_val: "../data/cifar10/21840_8.jpg"
        string_val: "../data/cifar10/211_7.jpg"
        string_val: "../data/cifar10/25265_5.jpg"
        string_val: "../data/cifar10/18400_3.jpg"
        string_val: "../data/cifar10/39593_8.jpg"
        string_val: "../data/cifar10/31476_4.jpg"
        string_val: "../data/cifar10/3866_4.jpg"
        string_val: "../data/cifar10/46271_6.jpg"
        string_val: "../data/cifar10/33937_9.jpg"
        string_val: "../data/cifar10/13649_0.jpg"
        string_val: "../data/cifar10/18099_4.jpg"
        string_val: "../data/cifar10/22593_3.jpg"
        string_val: "../data/cifar10/1644_4.jpg"
        string_val: "../data/cifar10/47739_5.jpg"
        string_val: "../data/cifar10/39071_3.jpg"
        string_val: "../data/cifar10/4298_8.jpg"
        string_val: "../data/cifar10/1671_8.jpg"
        string_val: "../data/cifar10/35739_6.jpg"
        string_val: "../data/cifar10/39390_2.jpg"
        string_val: "../data/cifar10/43182_6.jpg"
        string_val: "../data/cifar10/37020_9.jpg"
        string_val: "../data/cifar10/41632_6.jpg"
        string_val: "../data/cifar10/14475_9.jpg"
        string_val: "../data/cifar10/26463_8.jpg"
        string_val: "../data/cifar10/46863_8.jpg"
        string_val: "../data/cifar10/22485_7.jpg"
        string_val: "../data/cifar10/31327_8.jpg"
        string_val: "../data/cifar10/38547_0.jpg"
        string_val: "../data/cifar10/28315_4.jpg"
        string_val: "../data/cifar10/28816_6.jpg"
        string_val: "../data/cifar10/30253_7.jpg"
        string_val: "../data/cifar10/2543_2.jpg"
        string_val: "../data/cifar10/2305_5.jpg"
        string_val: "../data/cifar10/24020_0.jpg"
        string_val: "../data/cifar10/45241_9.jpg"
        string_val: "../data/cifar10/34674_6.jpg"
        string_val: "../data/cifar10/24131_8.jpg"
        string_val: "../data/cifar10/37371_0.jpg"
        string_val: "../data/cifar10/13523_1.jpg"
        string_val: "../data/cifar10/20928_0.jpg"
        string_val: "../data/cifar10/19589_3.jpg"
        string_val: "../data/cifar10/21625_3.jpg"
        string_val: "../data/cifar10/49816_9.jpg"
        string_val: "../data/cifar10/32696_7.jpg"
        string_val: "../data/cifar10/21743_0.jpg"
        string_val: "../data/cifar10/36540_5.jpg"
        string_val: "../data/cifar10/6505_4.jpg"
        string_val: "../data/cifar10/30489_1.jpg"
        string_val: "../data/cifar10/7864_5.jpg"
        string_val: "../data/cifar10/6227_2.jpg"
        string_val: "../data/cifar10/34692_4.jpg"
        string_val: "../data/cifar10/42901_6.jpg"
        string_val: "../data/cifar10/6235_7.jpg"
        string_val: "../data/cifar10/22280_2.jpg"
        string_val: "../data/cifar10/35983_6.jpg"
        string_val: "../data/cifar10/39835_7.jpg"
        string_val: "../data/cifar10/16317_9.jpg"
        string_val: "../data/cifar10/24847_3.jpg"
        string_val: "../data/cifar10/36121_5.jpg"
        string_val: "../data/cifar10/3864_3.jpg"
        string_val: "../data/cifar10/15410_6.jpg"
        string_val: "../data/cifar10/43830_7.jpg"
        string_val: "../data/cifar10/23865_8.jpg"
        string_val: "../data/cifar10/18520_3.jpg"
        string_val: "../data/cifar10/37318_8.jpg"
        string_val: "../data/cifar10/2828_1.jpg"
        string_val: "../data/cifar10/30015_3.jpg"
        string_val: "../data/cifar10/17162_8.jpg"
        string_val: "../data/cifar10/31649_3.jpg"
        string_val: "../data/cifar10/2498_9.jpg"
        string_val: "../data/cifar10/33090_2.jpg"
        string_val: "../data/cifar10/11024_5.jpg"
        string_val: "../data/cifar10/48364_2.jpg"
        string_val: "../data/cifar10/41929_0.jpg"
        string_val: "../data/cifar10/20916_0.jpg"
        string_val: "../data/cifar10/15133_5.jpg"
        string_val: "../data/cifar10/20078_7.jpg"
        string_val: "../data/cifar10/36155_0.jpg"
        string_val: "../data/cifar10/28561_4.jpg"
        string_val: "../data/cifar10/20771_6.jpg"
        string_val: "../data/cifar10/43969_1.jpg"
        string_val: "../data/cifar10/35856_9.jpg"
        string_val: "../data/cifar10/21918_7.jpg"
        string_val: "../data/cifar10/39859_9.jpg"
        string_val: "../data/cifar10/15210_3.jpg"
        string_val: "../data/cifar10/15311_3.jpg"
        string_val: "../data/cifar10/34755_5.jpg"
        string_val: "../data/cifar10/44183_1.jpg"
        string_val: "../data/cifar10/10452_3.jpg"
        string_val: "../data/cifar10/23882_4.jpg"
        string_val: "../data/cifar10/18263_1.jpg"
        string_val: "../data/cifar10/24010_1.jpg"
        string_val: "../data/cifar10/7958_6.jpg"
        string_val: "../data/cifar10/21254_4.jpg"
        string_val: "../data/cifar10/45015_2.jpg"
        string_val: "../data/cifar10/4676_7.jpg"
        string_val: "../data/cifar10/24322_2.jpg"
        string_val: "../data/cifar10/26090_1.jpg"
        string_val: "../data/cifar10/30023_2.jpg"
        string_val: "../data/cifar10/29348_0.jpg"
        string_val: "../data/cifar10/27304_3.jpg"
        string_val: "../data/cifar10/14276_5.jpg"
        string_val: "../data/cifar10/43962_5.jpg"
        string_val: "../data/cifar10/25520_3.jpg"
        string_val: "../data/cifar10/16058_4.jpg"
        string_val: "../data/cifar10/29407_8.jpg"
        string_val: "../data/cifar10/16041_2.jpg"
        string_val: "../data/cifar10/38301_8.jpg"
        string_val: "../data/cifar10/25149_2.jpg"
        string_val: "../data/cifar10/44024_5.jpg"
        string_val: "../data/cifar10/46850_6.jpg"
        string_val: "../data/cifar10/22725_7.jpg"
        string_val: "../data/cifar10/3231_1.jpg"
        string_val: "../data/cifar10/16068_4.jpg"
        string_val: "../data/cifar10/41696_0.jpg"
        string_val: "../data/cifar10/6053_5.jpg"
        string_val: "../data/cifar10/47368_2.jpg"
        string_val: "../data/cifar10/16809_9.jpg"
        string_val: "../data/cifar10/16668_6.jpg"
        string_val: "../data/cifar10/32539_4.jpg"
        string_val: "../data/cifar10/38776_4.jpg"
        string_val: "../data/cifar10/17587_7.jpg"
        string_val: "../data/cifar10/31001_8.jpg"
        string_val: "../data/cifar10/1634_5.jpg"
        string_val: "../data/cifar10/21752_1.jpg"
        string_val: "../data/cifar10/44783_2.jpg"
        string_val: "../data/cifar10/33081_2.jpg"
        string_val: "../data/cifar10/23569_9.jpg"
        string_val: "../data/cifar10/29334_9.jpg"
        string_val: "../data/cifar10/44313_3.jpg"
        string_val: "../data/cifar10/32771_1.jpg"
        string_val: "../data/cifar10/35448_2.jpg"
        string_val: "../data/cifar10/42104_4.jpg"
        string_val: "../data/cifar10/29300_2.jpg"
        string_val: "../data/cifar10/1887_0.jpg"
        string_val: "../data/cifar10/46882_3.jpg"
        string_val: "../data/cifar10/39051_2.jpg"
        string_val: "../data/cifar10/6410_4.jpg"
        string_val: "../data/cifar10/26325_5.jpg"
        string_val: "../data/cifar10/12862_4.jpg"
        string_val: "../data/cifar10/23995_3.jpg"
        string_val: "../data/cifar10/830_2.jpg"
        string_val: "../data/cifar10/40905_5.jpg"
        string_val: "../data/cifar10/49665_5.jpg"
        string_val: "../data/cifar10/47668_2.jpg"
        string_val: "../data/cifar10/31043_5.jpg"
        string_val: "../data/cifar10/14681_5.jpg"
        string_val: "../data/cifar10/27366_4.jpg"
        string_val: "../data/cifar10/15536_6.jpg"
        string_val: "../data/cifar10/1631_1.jpg"
        string_val: "../data/cifar10/29390_5.jpg"
        string_val: "../data/cifar10/33971_4.jpg"
        string_val: "../data/cifar10/45709_2.jpg"
        string_val: "../data/cifar10/39339_2.jpg"
        string_val: "../data/cifar10/8609_3.jpg"
        string_val: "../data/cifar10/9489_3.jpg"
        string_val: "../data/cifar10/32286_7.jpg"
        string_val: "../data/cifar10/8076_7.jpg"
        string_val: "../data/cifar10/36061_6.jpg"
        string_val: "../data/cifar10/7942_2.jpg"
        string_val: "../data/cifar10/36283_9.jpg"
        string_val: "../data/cifar10/20136_4.jpg"
        string_val: "../data/cifar10/21046_5.jpg"
        string_val: "../data/cifar10/9084_6.jpg"
        string_val: "../data/cifar10/39343_6.jpg"
        string_val: "../data/cifar10/41499_5.jpg"
        string_val: "../data/cifar10/43285_2.jpg"
        string_val: "../data/cifar10/14720_2.jpg"
        string_val: "../data/cifar10/20931_1.jpg"
        string_val: "../data/cifar10/14746_6.jpg"
        string_val: "../data/cifar10/38678_7.jpg"
        string_val: "../data/cifar10/26368_1.jpg"
        string_val: "../data/cifar10/20648_3.jpg"
        string_val: "../data/cifar10/21851_3.jpg"
        string_val: "../data/cifar10/43618_1.jpg"
        string_val: "../data/cifar10/7089_2.jpg"
        string_val: "../data/cifar10/38648_3.jpg"
        string_val: "../data/cifar10/43010_2.jpg"
        string_val: "../data/cifar10/44807_8.jpg"
        string_val: "../data/cifar10/3280_5.jpg"
        string_val: "../data/cifar10/38308_7.jpg"
        string_val: "../data/cifar10/17254_7.jpg"
        string_val: "../data/cifar10/44852_3.jpg"
        string_val: "../data/cifar10/47227_0.jpg"
        string_val: "../data/cifar10/36338_7.jpg"
        string_val: "../data/cifar10/27938_3.jpg"
        string_val: "../data/cifar10/26749_7.jpg"
        string_val: "../data/cifar10/35754_3.jpg"
        string_val: "../data/cifar10/37179_1.jpg"
        string_val: "../data/cifar10/1596_6.jpg"
        string_val: "../data/cifar10/36222_3.jpg"
        string_val: "../data/cifar10/17743_0.jpg"
        string_val: "../data/cifar10/1135_7.jpg"
        string_val: "../data/cifar10/3457_3.jpg"
        string_val: "../data/cifar10/13583_0.jpg"
        string_val: "../data/cifar10/44433_1.jpg"
        string_val: "../data/cifar10/34868_7.jpg"
        string_val: "../data/cifar10/17952_6.jpg"
        string_val: "../data/cifar10/39791_6.jpg"
        string_val: "../data/cifar10/24439_7.jpg"
        string_val: "../data/cifar10/42668_7.jpg"
        string_val: "../data/cifar10/42477_8.jpg"
        string_val: "../data/cifar10/36453_5.jpg"
        string_val: "../data/cifar10/9942_1.jpg"
        string_val: "../data/cifar10/43136_8.jpg"
        string_val: "../data/cifar10/1455_1.jpg"
        string_val: "../data/cifar10/21663_2.jpg"
        string_val: "../data/cifar10/28802_2.jpg"
        string_val: "../data/cifar10/32901_4.jpg"
        string_val: "../data/cifar10/49627_7.jpg"
        string_val: "../data/cifar10/6035_6.jpg"
        string_val: "../data/cifar10/27301_0.jpg"
        string_val: "../data/cifar10/45461_8.jpg"
        string_val: "../data/cifar10/26044_3.jpg"
        string_val: "../data/cifar10/7228_3.jpg"
        string_val: "../data/cifar10/9563_5.jpg"
        string_val: "../data/cifar10/3413_7.jpg"
        string_val: "../data/cifar10/7271_1.jpg"
        string_val: "../data/cifar10/24069_2.jpg"
        string_val: "../data/cifar10/4822_5.jpg"
        string_val: "../data/cifar10/8874_2.jpg"
        string_val: "../data/cifar10/34957_9.jpg"
        string_val: "../data/cifar10/22083_5.jpg"
        string_val: "../data/cifar10/46906_1.jpg"
        string_val: "../data/cifar10/291_8.jpg"
        string_val: "../data/cifar10/5040_9.jpg"
        string_val: "../data/cifar10/49990_4.jpg"
        string_val: "../data/cifar10/14450_0.jpg"
        string_val: "../data/cifar10/9711_7.jpg"
        string_val: "../data/cifar10/17605_7.jpg"
        string_val: "../data/cifar10/28212_0.jpg"
        string_val: "../data/cifar10/37627_4.jpg"
        string_val: "../data/cifar10/36709_3.jpg"
        string_val: "../data/cifar10/29905_1.jpg"
        string_val: "../data/cifar10/29476_8.jpg"
        string_val: "../data/cifar10/2648_3.jpg"
        string_val: "../data/cifar10/42094_2.jpg"
        string_val: "../data/cifar10/21536_3.jpg"
        string_val: "../data/cifar10/40751_1.jpg"
        string_val: "../data/cifar10/12613_9.jpg"
        string_val: "../data/cifar10/4247_7.jpg"
        string_val: "../data/cifar10/28780_1.jpg"
        string_val: "../data/cifar10/1670_2.jpg"
        string_val: "../data/cifar10/28114_2.jpg"
        string_val: "../data/cifar10/3930_9.jpg"
        string_val: "../data/cifar10/16033_4.jpg"
        string_val: "../data/cifar10/10076_4.jpg"
        string_val: "../data/cifar10/14954_9.jpg"
        string_val: "../data/cifar10/8304_2.jpg"
        string_val: "../data/cifar10/13756_6.jpg"
        string_val: "../data/cifar10/30360_9.jpg"
        string_val: "../data/cifar10/48818_1.jpg"
        string_val: "../data/cifar10/43170_4.jpg"
        string_val: "../data/cifar10/44399_3.jpg"
        string_val: "../data/cifar10/27116_7.jpg"
        string_val: "../data/cifar10/17927_9.jpg"
        string_val: "../data/cifar10/936_1.jpg"
        string_val: "../data/cifar10/48042_8.jpg"
        string_val: "../data/cifar10/11330_5.jpg"
        string_val: "../data/cifar10/47810_5.jpg"
        string_val: "../data/cifar10/5324_0.jpg"
